MikroElektronika/core_packages/ARM/gcc_clang/system/src/ti/mspm0l13/thirdparty/mspm0l13/ti/devices/msp/peripherals/hw_mcan.h
/* MCAN_ICS Bits */
/* MCAN_ICS[EXT_TS_CNTR_OVFL] Bits */
#define MCAN_ICS_EXT_TS_CNTR_OVFL_OFS            (0)                             /* !< EXT_TS_CNTR_OVFL Offset */
#define MCAN_ICS_EXT_TS_CNTR_OVFL_MASK           ((uint32_t)0x00000001U)         /* !< External Timestamp Counter Overflow
                                                                                    Interrupt Status Clear. Reads always
                                                                                    return a 0.   0  Write of '0' has no
                                                                                    effect   1  Write of '1' clears the
                                                                                    MCANSS_IRS.EXT_TS_CNTR_OVFL bit */

/* MCAN_IRS Bits */
/* MCAN_IRS[EXT_TS_CNTR_OVFL] Bits */
#define MCAN_IRS_EXT_TS_CNTR_OVFL_OFS            (0)                             /* !< EXT_TS_CNTR_OVFL Offset */
#define MCAN_IRS_EXT_TS_CNTR_OVFL_MASK           ((uint32_t)0x00000001U)         /* !< External Timestamp Counter Overflow
                                                                                    Interrupt Status. This bit is set by
                                                                                    HW or by a SW write of '1'. To clear,
                                                                                    use the MCANSS_ICS.EXT_TS_CNTR_OVFL
                                                                                    bit.   0  External timestamp counter
                                                                                    has not overflowed   1  External
                                                                                    timestamp counter has overflowed
                                                                                    When this bit is set to '1' by HW or
                                                                                    SW, the
                                                                                    MCANSS_EXT_TS_UNSERVICED_INTR_CNTR
                                                                                    .EXT_TS_INTR_CNTR bit field will
                                                                                    increment by 1. */

/* MCAN_IECS Bits */
/* MCAN_IECS[EXT_TS_CNTR_OVFL] Bits */
#define MCAN_IECS_EXT_TS_CNTR_OVFL_OFS           (0)                             /* !< EXT_TS_CNTR_OVFL Offset */
#define MCAN_IECS_EXT_TS_CNTR_OVFL_MASK          ((uint32_t)0x00000001U)         /* !< External Timestamp Counter Overflow
                                                                                    Interrupt Enable Clear. Reads always
                                                                                    return a 0.   0  Write of '0' has no
                                                                                    effect   1  Write of '1' clears the
                                                                                    MCANSS_IES.EXT_TS_CNTR_OVFL bit */

/* MCAN_TI_WRAPPER_PROCESSORS_REGS_IE Bits */
/* MCAN_TI_WRAPPER_PROCESSORS_REGS_IE[EXT_TS_CNTR_OVFL] Bits */
#define MCAN_TI_WRAPPER_PROCESSORS_REGS_IE_EXT_TS_CNTR_OVFL_OFS (0)                             /* !< EXT_TS_CNTR_OVFL Offset */
#define MCAN_TI_WRAPPER_PROCESSORS_REGS_IE_EXT_TS_CNTR_OVFL_MASK ((uint32_t)0x00000001U)         /* !< External Timestamp Counter Overflow
                                                                                    Interrupt Enable. A write of '0' has
                                                                                    no effect. A write of '1' sets the
                                                                                    MCANSS_IES.EXT_TS_CNTR_OVFL bit. */

/* MCAN_IES Bits */
/* MCAN_IES[EXT_TS_CNTR_OVFL] Bits */
#define MCAN_IES_EXT_TS_CNTR_OVFL_OFS            (0)                             /* !< EXT_TS_CNTR_OVFL Offset */
#define MCAN_IES_EXT_TS_CNTR_OVFL_MASK           ((uint32_t)0x00000001U)         /* !< External Timestamp Counter Overflow
                                                                                    Interrupt Enable Status. To set, use
                                                                                    the CANSS_IE.EXT_TS_CNTR_OVFL bit. To
                                                                                    clear, use the
                                                                                    MCANSS_IECS.EXT_TS_CNTR_OVFL bit.   0
                                                                                    External timestamp counter overflow
                                                                                    interrupt is not enabled   1
                                                                                    External timestamp counter overflow
                                                                                    interrupt is enabled */

/* MCAN_EOI Bits */
/* MCAN_EOI[EOI] Bits */
#define MCAN_EOI_EOI_OFS                         (0)                             /* !< EOI Offset */
#define MCAN_EOI_EOI_MASK                        ((uint32_t)0x000000FFU)         /* !< End of Interrupt. A write to this
                                                                                    register will clear the associated
                                                                                    interrupt. If the unserviced
                                                                                    interrupt counter is > 1, another
                                                                                    interrupt is generated.   0x00
                                                                                    External TS Interrupt is cleared
                                                                                    0x01  MCAN(0) interrupt is cleared
                                                                                    0x02  MCAN(1) interrupt is cleared
                                                                                    Other writes are ignored. */

/* MCAN_EXT_TS_PRESCALER Bits */
/* MCAN_EXT_TS_PRESCALER[PRESCALER] Bits */
#define MCAN_EXT_TS_PRESCALER_PRESCALER_OFS      (0)                             /* !< PRESCALER Offset */
#define MCAN_EXT_TS_PRESCALER_PRESCALER_MASK     ((uint32_t)0x00FFFFFFU)         /* !< External Timestamp Prescaler Reload
                                                                                    Value. The external timestamp count
                                                                                    rate is the host (system) clock rate
                                                                                    divided by this value, except in the
                                                                                    case of 0. A zero value in this bit
                                                                                    field will act identically to a value
                                                                                    of 0x000001. */

/* MCAN_EXT_TS_UNSERVICED_INTR_CNTR Bits */
/* MCAN_EXT_TS_UNSERVICED_INTR_CNTR[EXT_TS_INTR_CNTR] Bits */
#define MCAN_EXT_TS_UNSERVICED_INTR_CNTR_EXT_TS_INTR_CNTR_OFS (0)                             /* !< EXT_TS_INTR_CNTR Offset */
#define MCAN_EXT_TS_UNSERVICED_INTR_CNTR_EXT_TS_INTR_CNTR_MASK ((uint32_t)0x0000001FU)         /* !< External Timestamp Counter
                                                                                    Unserviced Rollover Interrupts. If
                                                                                    this value is > 1, an MCANSS_EOI
                                                                                    write of '1' to bit 0 will issue
                                                                                    another interrupt.   The status of
                                                                                    this bit field is affected by the
                                                                                    MCANSS_IRS.EXT_TS_CNTR_OVFL bit
                                                                                    field. */

/* MCAN_CREL Bits */
/* MCAN_CREL[DAY] Bits */
#define MCAN_CREL_DAY_OFS                        (0)                             /* !< DAY Offset */
#define MCAN_CREL_DAY_MASK                       ((uint32_t)0x000000FFU)         /* !< Time Stamp Day. Two digits,
                                                                                    BCD-coded. */
/* MCAN_CREL[MON] Bits */
#define MCAN_CREL_MON_OFS                        (8)                             /* !< MON Offset */
#define MCAN_CREL_MON_MASK                       ((uint32_t)0x0000FF00U)         /* !< Time Stamp Month. Two digits,
                                                                                    BCD-coded. */
/* MCAN_CREL[YEAR] Bits */
#define MCAN_CREL_YEAR_OFS                       (16)                            /* !< YEAR Offset */
#define MCAN_CREL_YEAR_MASK                      ((uint32_t)0x000F0000U)         /* !< Time Stamp Year. One digit,
                                                                                    BCD-coded. */
/* MCAN_CREL[SUBSTEP] Bits */
#define MCAN_CREL_SUBSTEP_OFS                    (20)                            /* !< SUBSTEP Offset */
#define MCAN_CREL_SUBSTEP_MASK                   ((uint32_t)0x00F00000U)         /* !< Sub-Step of Core Release. One
                                                                                    digit, BCD-coded. */
/* MCAN_CREL[STEP] Bits */
#define MCAN_CREL_STEP_OFS                       (24)                            /* !< STEP Offset */
#define MCAN_CREL_STEP_MASK                      ((uint32_t)0x0F000000U)         /* !< Step of Core Release. One digit,
                                                                                    BCD-coded. */
/* MCAN_CREL[REL] Bits */
#define MCAN_CREL_REL_OFS                        (28)                            /* !< REL Offset */
#define MCAN_CREL_REL_MASK                       ((uint32_t)0xF0000000U)         /* !< Core Release. One digit, BCD-coded. */

/* MCAN_ENDN Bits */
/* MCAN_ENDN[ETV] Bits */
#define MCAN_ENDN_ETV_OFS                        (0)                             /* !< ETV Offset */
#define MCAN_ENDN_ETV_MASK                       ((uint32_t)0xFFFFFFFFU)         /* !< Endianess Test Value. Reading the
                                                                                    constant value maintained in this
                                                                                    register allows software to determine
                                                                                    the endianess of the host CPU. */

