MikroElektronika/core_packages/ARM/gcc_clang/system/src/ti/mspm0l13/thirdparty/mspm0l13/ti/devices/msp/peripherals/hw_mcan.h
/* MCAN_HPMS Bits */
/* MCAN_HPMS[BIDX] Bits */
#define MCAN_HPMS_BIDX_OFS                       (0)                             /* !< BIDX Offset */
#define MCAN_HPMS_BIDX_MASK                      ((uint32_t)0x0000003FU)         /* !< Buffer Index. Index of Rx FIFO
                                                                                    element to which the message was
                                                                                    stored. Only valid when MSI(1) = '1'. */
/* MCAN_HPMS[MSI] Bits */
#define MCAN_HPMS_MSI_OFS                        (6)                             /* !< MSI Offset */
#define MCAN_HPMS_MSI_MASK                       ((uint32_t)0x000000C0U)         /* !< Message Storage Indicator   00  No
                                                                                    FIFO selected   01  FIFO message lost
                                                                                    10  Message stored in FIFO 0   11
                                                                                    Message stored in FIFO 1 */
/* MCAN_HPMS[FIDX] Bits */
#define MCAN_HPMS_FIDX_OFS                       (8)                             /* !< FIDX Offset */
#define MCAN_HPMS_FIDX_MASK                      ((uint32_t)0x00007F00U)         /* !< Filter Index. Index of matching
                                                                                    filter element. Range is 0 to
                                                                                    SIDFC.LSS - 1 resp. XIDFC.LSE - 1. */
/* MCAN_HPMS[FLST] Bits */
#define MCAN_HPMS_FLST_OFS                       (15)                            /* !< FLST Offset */
#define MCAN_HPMS_FLST_MASK                      ((uint32_t)0x00008000U)         /* !< Filter List. Indicates the filter
                                                                                    list of the matching filter element.
                                                                                    0  Standard Filter List   1
                                                                                    Extended Filter List */

/* MCAN_NDAT1 Bits */
/* MCAN_NDAT1[ND0] Bits */
#define MCAN_NDAT1_ND0_OFS                       (0)                             /* !< ND0 Offset */
#define MCAN_NDAT1_ND0_MASK                      ((uint32_t)0x00000001U)         /* !< New Data RX Buffer 0   0  Rx Buffer
                                                                                    not up2025-10-02d   1  Rx Buffer up2025-10-02d
                                                                                    from new message */
/* MCAN_NDAT1[ND1] Bits */
#define MCAN_NDAT1_ND1_OFS                       (1)                             /* !< ND1 Offset */
#define MCAN_NDAT1_ND1_MASK                      ((uint32_t)0x00000002U)         /* !< New Data RX Buffer 1   0  Rx Buffer
                                                                                    not up2025-10-02d   1  Rx Buffer up2025-10-02d
                                                                                    from new message */
/* MCAN_NDAT1[ND2] Bits */
#define MCAN_NDAT1_ND2_OFS                       (2)                             /* !< ND2 Offset */
#define MCAN_NDAT1_ND2_MASK                      ((uint32_t)0x00000004U)         /* !< New Data RX Buffer 2   0  Rx Buffer
                                                                                    not up2025-10-02d   1  Rx Buffer up2025-10-02d
                                                                                    from new message */
/* MCAN_NDAT1[ND3] Bits */
#define MCAN_NDAT1_ND3_OFS                       (3)                             /* !< ND3 Offset */
#define MCAN_NDAT1_ND3_MASK                      ((uint32_t)0x00000008U)         /* !< New Data RX Buffer 3   0  Rx Buffer
                                                                                    not up2025-10-02d   1  Rx Buffer up2025-10-02d
                                                                                    from new message */
/* MCAN_NDAT1[ND4] Bits */
#define MCAN_NDAT1_ND4_OFS                       (4)                             /* !< ND4 Offset */
#define MCAN_NDAT1_ND4_MASK                      ((uint32_t)0x00000010U)         /* !< New Data RX Buffer 4   0  Rx Buffer
                                                                                    not up2025-10-02d   1  Rx Buffer up2025-10-02d
                                                                                    from new message */
/* MCAN_NDAT1[ND5] Bits */
#define MCAN_NDAT1_ND5_OFS                       (5)                             /* !< ND5 Offset */
#define MCAN_NDAT1_ND5_MASK                      ((uint32_t)0x00000020U)         /* !< New Data RX Buffer 5   0  Rx Buffer
                                                                                    not up2025-10-02d   1  Rx Buffer up2025-10-02d
                                                                                    from new message */
/* MCAN_NDAT1[ND6] Bits */
#define MCAN_NDAT1_ND6_OFS                       (6)                             /* !< ND6 Offset */
#define MCAN_NDAT1_ND6_MASK                      ((uint32_t)0x00000040U)         /* !< New Data RX Buffer 6   0  Rx Buffer
                                                                                    not up2025-10-02d   1  Rx Buffer up2025-10-02d
                                                                                    from new message */
/* MCAN_NDAT1[ND7] Bits */
#define MCAN_NDAT1_ND7_OFS                       (7)                             /* !< ND7 Offset */
#define MCAN_NDAT1_ND7_MASK                      ((uint32_t)0x00000080U)         /* !< New Data RX Buffer 7   0  Rx Buffer
                                                                                    not up2025-10-02d   1  Rx Buffer up2025-10-02d
                                                                                    from new message */
/* MCAN_NDAT1[ND8] Bits */
#define MCAN_NDAT1_ND8_OFS                       (8)                             /* !< ND8 Offset */
#define MCAN_NDAT1_ND8_MASK                      ((uint32_t)0x00000100U)         /* !< New Data RX Buffer 8   0  Rx Buffer
                                                                                    not up2025-10-02d   1  Rx Buffer up2025-10-02d
                                                                                    from new message */
/* MCAN_NDAT1[ND9] Bits */
#define MCAN_NDAT1_ND9_OFS                       (9)                             /* !< ND9 Offset */
#define MCAN_NDAT1_ND9_MASK                      ((uint32_t)0x00000200U)         /* !< New Data RX Buffer 9   0  Rx Buffer
                                                                                    not up2025-10-02d   1  Rx Buffer up2025-10-02d
                                                                                    from new message */
/* MCAN_NDAT1[ND10] Bits */
#define MCAN_NDAT1_ND10_OFS                      (10)                            /* !< ND10 Offset */
#define MCAN_NDAT1_ND10_MASK                     ((uint32_t)0x00000400U)         /* !< New Data RX Buffer 10   0  Rx
                                                                                    Buffer not up2025-10-02d   1  Rx Buffer
                                                                                    up2025-10-02d from new message */
/* MCAN_NDAT1[ND11] Bits */
#define MCAN_NDAT1_ND11_OFS                      (11)                            /* !< ND11 Offset */
#define MCAN_NDAT1_ND11_MASK                     ((uint32_t)0x00000800U)         /* !< New Data RX Buffer 11   0  Rx
                                                                                    Buffer not up2025-10-02d   1  Rx Buffer
                                                                                    up2025-10-02d from new message */
/* MCAN_NDAT1[ND12] Bits */
#define MCAN_NDAT1_ND12_OFS                      (12)                            /* !< ND12 Offset */
#define MCAN_NDAT1_ND12_MASK                     ((uint32_t)0x00001000U)         /* !< New Data RX Buffer 12   0  Rx
                                                                                    Buffer not up2025-10-02d   1  Rx Buffer
                                                                                    up2025-10-02d from new message */
/* MCAN_NDAT1[ND13] Bits */
#define MCAN_NDAT1_ND13_OFS                      (13)                            /* !< ND13 Offset */
#define MCAN_NDAT1_ND13_MASK                     ((uint32_t)0x00002000U)         /* !< New Data RX Buffer 13   0  Rx
                                                                                    Buffer not up2025-10-02d   1  Rx Buffer
                                                                                    up2025-10-02d from new message */
/* MCAN_NDAT1[ND14] Bits */
#define MCAN_NDAT1_ND14_OFS                      (14)                            /* !< ND14 Offset */
#define MCAN_NDAT1_ND14_MASK                     ((uint32_t)0x00004000U)         /* !< New Data RX Buffer 14   0  Rx
                                                                                    Buffer not up2025-10-02d   1  Rx Buffer
                                                                                    up2025-10-02d from new message */
/* MCAN_NDAT1[ND15] Bits */
#define MCAN_NDAT1_ND15_OFS                      (15)                            /* !< ND15 Offset */
#define MCAN_NDAT1_ND15_MASK                     ((uint32_t)0x00008000U)         /* !< New Data RX Buffer 15   0  Rx
                                                                                    Buffer not up2025-10-02d   1  Rx Buffer
                                                                                    up2025-10-02d from new message */
/* MCAN_NDAT1[ND16] Bits */
#define MCAN_NDAT1_ND16_OFS                      (16)                            /* !< ND16 Offset */
#define MCAN_NDAT1_ND16_MASK                     ((uint32_t)0x00010000U)         /* !< New Data RX Buffer 16   0  Rx
                                                                                    Buffer not up2025-10-02d   1  Rx Buffer
                                                                                    up2025-10-02d from new message */
/* MCAN_NDAT1[ND17] Bits */
#define MCAN_NDAT1_ND17_OFS                      (17)                            /* !< ND17 Offset */
#define MCAN_NDAT1_ND17_MASK                     ((uint32_t)0x00020000U)         /* !< New Data RX Buffer 17   0  Rx
                                                                                    Buffer not up2025-10-02d   1  Rx Buffer
                                                                                    up2025-10-02d from new message */
/* MCAN_NDAT1[ND18] Bits */
#define MCAN_NDAT1_ND18_OFS                      (18)                            /* !< ND18 Offset */
#define MCAN_NDAT1_ND18_MASK                     ((uint32_t)0x00040000U)         /* !< New Data RX Buffer 18   0  Rx
                                                                                    Buffer not up2025-10-02d   1  Rx Buffer
                                                                                    up2025-10-02d from new message */
/* MCAN_NDAT1[ND19] Bits */
#define MCAN_NDAT1_ND19_OFS                      (19)                            /* !< ND19 Offset */
#define MCAN_NDAT1_ND19_MASK                     ((uint32_t)0x00080000U)         /* !< New Data RX Buffer 19   0  Rx
                                                                                    Buffer not up2025-10-02d   1  Rx Buffer
                                                                                    up2025-10-02d from new message */
/* MCAN_NDAT1[ND20] Bits */
#define MCAN_NDAT1_ND20_OFS                      (20)                            /* !< ND20 Offset */
#define MCAN_NDAT1_ND20_MASK                     ((uint32_t)0x00100000U)         /* !< New Data RX Buffer 20   0  Rx
                                                                                    Buffer not up2025-10-02d   1  Rx Buffer
                                                                                    up2025-10-02d from new message */
/* MCAN_NDAT1[ND21] Bits */
#define MCAN_NDAT1_ND21_OFS                      (21)                            /* !< ND21 Offset */
#define MCAN_NDAT1_ND21_MASK                     ((uint32_t)0x00200000U)         /* !< New Data RX Buffer 21   0  Rx
                                                                                    Buffer not up2025-10-02d   1  Rx Buffer
                                                                                    up2025-10-02d from new message */
/* MCAN_NDAT1[ND22] Bits */
#define MCAN_NDAT1_ND22_OFS                      (22)                            /* !< ND22 Offset */
#define MCAN_NDAT1_ND22_MASK                     ((uint32_t)0x00400000U)         /* !< New Data RX Buffer 22   0  Rx
                                                                                    Buffer not up2025-10-02d   1  Rx Buffer
                                                                                    up2025-10-02d from new message */
/* MCAN_NDAT1[ND23] Bits */
#define MCAN_NDAT1_ND23_OFS                      (23)                            /* !< ND23 Offset */
#define MCAN_NDAT1_ND23_MASK                     ((uint32_t)0x00800000U)         /* !< New Data RX Buffer 23   0  Rx
                                                                                    Buffer not up2025-10-02d   1  Rx Buffer
                                                                                    up2025-10-02d from new message */
/* MCAN_NDAT1[ND24] Bits */
#define MCAN_NDAT1_ND24_OFS                      (24)                            /* !< ND24 Offset */
#define MCAN_NDAT1_ND24_MASK                     ((uint32_t)0x01000000U)         /* !< New Data RX Buffer 24   0  Rx
                                                                                    Buffer not up2025-10-02d   1  Rx Buffer
                                                                                    up2025-10-02d from new message */
/* MCAN_NDAT1[ND25] Bits */
#define MCAN_NDAT1_ND25_OFS                      (25)                            /* !< ND25 Offset */
#define MCAN_NDAT1_ND25_MASK                     ((uint32_t)0x02000000U)         /* !< New Data RX Buffer 25   0  Rx
                                                                                    Buffer not up2025-10-02d   1  Rx Buffer
                                                                                    up2025-10-02d from new message */
/* MCAN_NDAT1[ND26] Bits */
#define MCAN_NDAT1_ND26_OFS                      (26)                            /* !< ND26 Offset */
#define MCAN_NDAT1_ND26_MASK                     ((uint32_t)0x04000000U)         /* !< New Data RX Buffer 26   0  Rx
                                                                                    Buffer not up2025-10-02d   1  Rx Buffer
                                                                                    up2025-10-02d from new message */
/* MCAN_NDAT1[ND27] Bits */
#define MCAN_NDAT1_ND27_OFS                      (27)                            /* !< ND27 Offset */
#define MCAN_NDAT1_ND27_MASK                     ((uint32_t)0x08000000U)         /* !< New Data RX Buffer 27   0  Rx
                                                                                    Buffer not up2025-10-02d   1  Rx Buffer
                                                                                    up2025-10-02d from new message */
/* MCAN_NDAT1[ND28] Bits */
#define MCAN_NDAT1_ND28_OFS                      (28)                            /* !< ND28 Offset */
#define MCAN_NDAT1_ND28_MASK                     ((uint32_t)0x10000000U)         /* !< New Data RX Buffer 28   0  Rx
                                                                                    Buffer not up2025-10-02d   1  Rx Buffer
                                                                                    up2025-10-02d from new message */
/* MCAN_NDAT1[ND29] Bits */
#define MCAN_NDAT1_ND29_OFS                      (29)                            /* !< ND29 Offset */
#define MCAN_NDAT1_ND29_MASK                     ((uint32_t)0x20000000U)         /* !< New Data RX Buffer 29   0  Rx
                                                                                    Buffer not up2025-10-02d   1  Rx Buffer
                                                                                    up2025-10-02d from new message */
/* MCAN_NDAT1[ND30] Bits */
#define MCAN_NDAT1_ND30_OFS                      (30)                            /* !< ND30 Offset */
#define MCAN_NDAT1_ND30_MASK                     ((uint32_t)0x40000000U)         /* !< New Data RX Buffer 30   0  Rx
                                                                                    Buffer not up2025-10-02d   1  Rx Buffer
                                                                                    up2025-10-02d from new message */
/* MCAN_NDAT1[ND31] Bits */
#define MCAN_NDAT1_ND31_OFS                      (31)                            /* !< ND31 Offset */
#define MCAN_NDAT1_ND31_MASK                     ((uint32_t)0x80000000U)         /* !< New Data RX Buffer 31   0  Rx
                                                                                    Buffer not up2025-10-02d   1  Rx Buffer
                                                                                    up2025-10-02d from new message */

